dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_csd.c
    /* Disconnect previous sensors if they have been connected */
    Cy_CapSense_CSDSnsStateCheck(context);

    /* Setup new widget/sensor */
    Cy_CapSense_InitActivePtr(widgetId, sensorId, context);
    Cy_CapSense_CSDConnectSnsExt(context);
    Cy_CapSense_CSDSetUpIdacs(context);
    Cy_CapSense_CSDCalculateScanDuration(context);
    Cy_CapSense_CSDConfigClock(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDStartSample
****************************************************************************//**
*
* Starts the CSD conversion.
*
* This function assumes that the CSD HW block is already set up using
* the Cy_CapSense_CSDSetupWidget() and the sensor port-pin is connected to the CSD
* block using Cy_CapSense_CSDConnectSns().
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDStartSample(cy_stc_capsense_context_t * context)
{
    if(NULL != context->ptrCommonContext->ptrSSCallback)
    {
        context->ptrCommonContext->ptrSSCallback(context->ptrActiveScanSns);
    }

    /* Precharging Cmod and Csh */
    Cy_CapSense_CSDCmodPrecharge(context);

    /* Trigger Scan */
    Cy_CapSense_CSDTriggerScan(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDScanExt
****************************************************************************//**
*
* Starts the CSD conversion on the preconfigured sensor. 
* 
* \note This function is obsolete and kept for backward compatibility only. 
* The Cy_CapSense_ScanExt() function should be used instead.
*
* This function performs scanning of a specific sensor in the widget 
* previously initialized using the Cy_CapSense_CSDSetupWidgetExt() function. 
* 
* This function is called when no scanning is in progress. 
* I.e. Cy_CapSense_IsBusy() returns a non-busy status and the widget must 
* be preconfigured using Cy_CapSense_CSDSetupWidgetExt() function prior 
* to calling this function. Calling this function directly from 
* the application program is not recommended. This function is used to 
* implement only the user's specific use cases (for example faster execution).
* 
* This function does not disconnect sensor GPIOs from CSD HW block at the 
* end of a scan, therefore making subsequent scan of the same sensor is faster. 
* If sensor needs to be disconnected after the scan, 
* Cy_CapSense_CSDDisconnectSns() function can be used.
* 
* Calling Cy_CapSense_SetupWidget(), Cy_CapSense_CSDSetupWidget(), 
* Cy_CapSense_ScanAllWidgets(), or if Cy_CapSense_RunTuner() returns 
* CY_CAPSENSE_STATUS_RESTART_DONE status invalidated initialization 
* made by this function.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDScanExt(cy_stc_capsense_context_t * context)
{
    cy_stc_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;

    /* Set MFS channel index to 0 */
    ptrActive->mfsChannelIndex = 0u;

    /* Initialize the Active Context pointer with the CH0 context */
    ptrActive->ptrSnsContext = &ptrActive->ptrWdConfig->ptrSnsContext[ptrActive->sensorIndex];

    /* Set Start of sensor scan flag */
    Cy_CapSense_SetBusyFlags(context);

    /* Set scope flag */
    ptrActive->scanScopeSns = CY_CAPSENSE_SCAN_SCOPE_SGL_SNS;

    /* Initiate scan */
    Cy_CapSense_CSDStartSample(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDScan
****************************************************************************//**
*
* This function initiates a scan for the sensors of the widget initialized 
* by the Cy_CapSense_CSDSetupWidget() function.
*
* \note This function is obsolete and kept for backward compatibility only. 
* The Cy_CapSense_Scan() function should be used instead.
*
* This function does the following tasks:
* 1. Connects the first sensor of the widget.
* 2. Configures the IDAC value.
* 3. Starts scanning for the first sensor in the widget.
*
* This function is called by the Cy_CapSense_Scan() if the given
* widget uses the CSD sensing method.
*
* Calling this function directly from the application program is not
* recommended. This function is used to implement only the user's specific
* use cases (for example faster execution).
*
* This function is called when no scanning is in progress. I.e.
* Cy_CapSense_IsBusy() returns a non-busy status and the widget must be
* preconfigured using the Cy_CapSense_CSDSetupWidget() function prior
* to calling this function.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDScan(cy_stc_capsense_context_t * context)
{
    Cy_CapSense_InitActivePtrSns(0u, context);
        
    /* Setup Idac Value */
    Cy_CapSense_CSDSetUpIdacs(context);
    Cy_CapSense_CSDConnectSnsExt(context);

    /* Set Start of sensor scan flag */
    Cy_CapSense_SetBusyFlags(context);
    /* Set scope flag */
    context->ptrActiveScanSns->scanScopeSns = CY_CAPSENSE_SCAN_SCOPE_ALL_SNS;
    /* Initiate scan */
    Cy_CapSense_CSDStartSample(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDConnectSnsExt
****************************************************************************//**
*
* Connects a ganged sensor port-pin to the CSD HW block via the AMUX bus.
*
* The function gets the IO configuration registers addresses, their shifts and
* masks from the cy_stc_capsense_pin_config_t object. Basing on this data, it
* updates the HSIOM and PC registers.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDConnectSnsExt(cy_stc_capsense_context_t * context)
{
    cy_stc_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;
    const cy_stc_capsense_electrode_config_t * ptrActiveSns = ptrActive->ptrEltdConfig;
    const cy_stc_capsense_pin_config_t * ptrActivePin = ptrActiveSns->ptrPin;
    uint32_t i;

    /* Connect all pins of current sensors */
    for(i = 0u; i < ptrActiveSns->numPins; i++)
    {
        Cy_CapSense_CSDConnectSns(ptrActivePin, context);
        ptrActivePin++;
    }
    ptrActive->connectedSnsState = CY_CAPSENSE_SNS_CONNECTED;
}


