dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_csd.c
/*******************************************************************************
* Function Name: Cy_CapSense_CSDDisconnectSnsExt
****************************************************************************//**
*
* Disconnects a ganged sensor port-pin from the CSD HW block and AMUX bus.
* Sets the default state of the un-scanned sensor.
*
* The function gets the IO configuration registers addresses, their shifts and
* masks from the cy_stc_capsense_pin_config_t object. Basing on this data and
* Inactive sensor connection parameter, it updates the HSIOM, PC and DR registers.
* The HSIOM register is updated only when the Inactive sensor connection parameter
* is set to Shield.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDDisconnectSnsExt(cy_stc_capsense_context_t * context)
{
    cy_stc_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;
    const cy_stc_capsense_electrode_config_t * ptrActiveSns = ptrActive->ptrEltdConfig;
    const cy_stc_capsense_pin_config_t * ptrActivePin = ptrActiveSns->ptrPin;
    
    uint32_t i;

    /* Disconnect all pins of current sensors */
    for(i = 0u; i < ptrActiveSns->numPins; i++)
    {
        Cy_CapSense_CSDDisconnectSns(ptrActivePin, context);
        ptrActivePin++;
    }
    ptrActive->connectedSnsState = CY_CAPSENSE_SNS_DISCONNECTED;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDConnectSns
****************************************************************************//**
*
* Connects port pin to the CSD HW block using AMUX bus.
* 
* This function can be used to customize default sensor connection 
* by connecting one or more pins to existing sensor prior to initiating 
* scan of the sensor.
* 
* The function ignores the fact if the sensor is a ganged sensor and 
* connects only a specified port pin to the CSD HW block. This function can 
* only use GPIOs that is already assigned to CapSense middleware.
* 
* The functions that perform a setup and scan of a sensor/widget do not 
* take into account changes in the design made by 
* the Cy_CapSense_CSDConnectSns() function, hence all GPIOs connected 
* using this function must be disconnected using 
* the Cy_CapSense_CSDDisconnectSns() function prior to initializing 
* new widgets. Use this function in StartSample 
* callback (see the \ref group_capsense_callbacks section for details) 
* or with low-level functions that perform a single-sensor scanning.
* 
* Scanning should be completed before calling this function.
*
* \param snsAddrPtr
* Specifies the pointer to the cy_stc_capsense_pin_config_t object belonging to
* a sensor which to be connected to the CSD HW block.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
* 
* An example of using the function to perform port pin re-connection: 
* \snippet capsense\1.1\snippet\main.c snippet_Cy_CapSense_CSDConnect
* 
*******************************************************************************/
void Cy_CapSense_CSDConnectSns(
                const cy_stc_capsense_pin_config_t * snsAddrPtr, 
                cy_stc_capsense_context_t * context)
{
    Cy_CapSense_SsConfigPinRegisters(snsAddrPtr->pcPtr, (uint32_t)snsAddrPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_CSD_SENSE);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDDisconnectSns
****************************************************************************//**
*
* Disconnects port pin from the CSD HW block by disconnecting it from AMUX bus.
* 
* This function can be used to disconnect a sensor connected 
* using the Cy_CapSense_CSDConnectSns() function. In addition, this 
* function can be used to customize default sensor connection by 
* disconnecting one or more already connected sensors prior to 
* initiating scan of the sensor.
* 
* This function works identically to the Cy_CapSense_CSDConnectSns() function 
* except it disconnects the specified port-pin used by the sensor.
*
* Scanning should be completed before calling this function.
*
* \param  snsAddrPtr
* Specifies the pointer to the cy_stc_capsense_pin_config_t object belonging to
* a sensor which should be disconnected from the CSD HW block.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
* 
* An example of using the function to perform port pin re-connection: 
* \snippet capsense\1.1\snippet\main.c snippet_Cy_CapSense_CSDConnect
* 
*******************************************************************************/
void Cy_CapSense_CSDDisconnectSns(
                const cy_stc_capsense_pin_config_t * snsAddrPtr, 
                const cy_stc_capsense_context_t * context)
{
    uint32_t interruptState;
    
    Cy_CapSense_SsConfigPinRegisters(snsAddrPtr->pcPtr, (uint32_t)snsAddrPtr->pinNumber, 
                                     context->ptrInternalContext->csdInactiveSnsDm, 
                                     context->ptrInternalContext->csdInactiveSnsHsiom);

    interruptState = Cy_SysLib_EnterCriticalSection();
    Cy_GPIO_Clr(snsAddrPtr->pcPtr, (uint32_t)snsAddrPtr->pinNumber);
    Cy_SysLib_ExitCriticalSection(interruptState);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDClearSensors
****************************************************************************//**
*
* Resets all the CSD sensors to the non-sampling state by sequentially
* disconnecting all the sensors from the Analog MUX bus and putting them to
* an inactive state.
*
* The function goes through all the widgets and updates appropriate bits in
* the IO HSIOM, PC and DR registers depending on the Inactive sensor connection
* parameter. DR register bits are set to zero when the Inactive sensor
* connection is Ground or Hi-Z.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDClearSensors(const cy_stc_capsense_context_t * context)
{
    uint32_t wdgtIndex;
    uint32_t snsIndex;
    uint32_t pinIndex;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    const cy_stc_capsense_electrode_config_t * ptrSnsCfg;
    
