dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_csd.c
    /* Restore Ext Cap settings */
    interruptState = Cy_SysLib_EnterCriticalSection();
    Cy_GPIO_SetDrivemode(context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod, pcReg);
    Cy_GPIO_SetHSIOM(context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod, hsiomReg);
    Cy_SysLib_ExitCriticalSection(interruptState);
}


/*******************************************************************************
* Function Name: Cy_CapSense_SsCSDSwitchIdacGain
****************************************************************************//**
*
* Switches to the lower IDAC gain is possible.
*
* This internal function switches to the lower IDAC gain is possible.
* Conditions of switching to the lower IDAC gains:
* 1. The current IDAC gain is not the lowest one.
* 2. The maximum IDAC at gain switching will not be out of range.
* 3. The minimum IDAC is still below the acceptable range.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return Returns the status of the operation:
* - Zero     - Gain switching is not needed.
* - Non-Zero - Gain was switched to the lower one.
*
*******************************************************************************/
static uint32_t Cy_CapSense_CSDSwitchIdacGain(cy_stc_capsense_context_t * context)
{
    uint32_t ratio;
    uint32_t maxIdac;
    uint32_t minIdac;
    uint32_t swStatus = 0u;
    cy_stc_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    uint32_t gainIndex = ptrActive->ptrWdContext->idacGainIndex;
    uint32_t snsIndex;
    uint32_t idacVal;
    uint8_t freqChIndex;
    uint8_t freqChNumber;

    maxIdac = 0u;
    minIdac = CY_CAPSENSE_CAL_IDAC_MAX_VALUE;
        
    freqChNumber = (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->mfsEn) ? 3u : 1u;
    for(freqChIndex = 0u; freqChIndex < freqChNumber; freqChIndex++)
    {        
        /* Find maximum and minimum IDACs */
        idacVal = ptrActive->ptrWdContext->idacMod[freqChIndex];
        if (maxIdac < idacVal)
        {
            maxIdac = idacVal;
        }
        if (minIdac > idacVal)
        {
            minIdac = idacVal;
        }
        /* Check for sensorIndex >= numCols added and choose rowIdac if needed */
        if ((((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrActive->ptrWdConfig->wdType) || 
             ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrActive->ptrWdConfig->wdType)) &&
             (ptrActive->ptrWdConfig->numCols <= ptrActive->sensorIndex))
        {
            idacVal = ptrActive->ptrWdContext->rowIdacMod[freqChIndex];
            if (maxIdac < idacVal)
            {
                maxIdac = idacVal;
            }
            if (minIdac > idacVal)
            {
                minIdac = idacVal;
            }
        }
        
        /* Set value for iDac comp */
        if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdIdacCompEn)
        {    
            for(snsIndex = 0u; snsIndex < ptrActive->ptrWdConfig->numSns; snsIndex++)
            {
                ptrSnsCxt = &ptrActive->ptrWdConfig->ptrSnsContext[snsIndex];
                idacVal = ptrSnsCxt[freqChIndex * context->ptrCommonConfig->numSns].idacComp;
                if (minIdac > idacVal)
                {
                    minIdac = idacVal;
                }
            }
        }
    }
        
    /* Check gain switch conditions */
    if (gainIndex != 0u)
    {
        if (minIdac < context->ptrCommonConfig->csdIdacMin)
        {
            ratio = context->ptrCommonConfig->idacGainTable[gainIndex].gainValue / 
                    context->ptrCommonConfig->idacGainTable[gainIndex - 1u].gainValue;
            if ((maxIdac * ratio) < CY_CAPSENSE_CAL_IDAC_MAX_VALUE)
            {
                /* Switch to lower idac gain */
                ptrActive->ptrWdContext->idacGainIndex--;
                swStatus = 1u;
            }
        }
    }
    return (swStatus);
}
    

/*******************************************************************************
* Function Name: Cy_CapSense_SsCSDNormalizeIdac
****************************************************************************//**
*
* This function normalizes compensation IDAC.
*
* \param ptrWdConfig 
* Specifies the pointer to a widget configuration structure.
*
* \param target
* Raw count target in percentage.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSDNormalizeIdac(
                cy_stc_capsense_widget_config_t const * ptrWdConfig, 
                uint32_t target,
                const cy_stc_capsense_context_t * context)
{
    uint32_t snsIndex;
    uint32_t maxIdac;
    uint32_t minIdac;
    uint32_t minRaw;
    uint32_t rawLevel;
    uint32_t iMod;

    uint8_t freqChIndex;
    uint8_t freqChNumber;
    
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdConfig->ptrWdContext;
    uint32_t maxRawLevel = ptrWdCxt->maxRawCount;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    
    freqChNumber = (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->mfsEn) ? 3u : 1u;
    for(freqChIndex = 0u; freqChIndex < freqChNumber; freqChIndex++)
    {
        /* Find maximum and minimum IDACs */
        maxIdac = ptrWdConfig->ptrWdContext->idacMod[freqChIndex];
        minIdac = maxIdac;
        ptrSnsCxt = &ptrWdConfig->ptrSnsContext[freqChIndex * context->ptrCommonConfig->numSns];
        minRaw = ptrSnsCxt->raw;
        for(snsIndex = 0u; snsIndex < ptrWdConfig->numCols; snsIndex++)
        {
            if (minIdac > ptrSnsCxt->idacComp)
            {
                minIdac = ptrSnsCxt->idacComp;
                minRaw = ptrSnsCxt->raw;
            }
            ptrSnsCxt++;
        }
        
        /* Define new modulator IDAC */
        rawLevel = ((minRaw * CY_CAPSENSE_PERCENTAGE_100) / maxRawLevel) + CY_CAPSENSE_PERCENTAGE_100;
        iMod = (rawLevel * minIdac) / target;
        
        if (iMod > maxIdac)
        {
            iMod = maxIdac;
        }
        ptrWdCxt->idacMod[freqChIndex] = (uint8_t)iMod;
        
