dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_csd.c
        /* Re-calculate compensation IDAC */
        ptrSnsCxt = &ptrWdConfig->ptrSnsContext[freqChIndex * context->ptrCommonConfig->numSns];
        for(snsIndex = 0u; snsIndex < ptrWdConfig->numCols; snsIndex++)
        {
            rawLevel = ((((uint32_t)ptrSnsCxt->raw * CY_CAPSENSE_PERCENTAGE_100) / maxRawLevel) + 
                CY_CAPSENSE_PERCENTAGE_100) * ptrSnsCxt->idacComp;
            if (rawLevel < (iMod * target))
            {
                ptrSnsCxt->idacComp = 0u;
            }
            else
            {
                ptrSnsCxt->idacComp = (uint8_t)(((rawLevel - (iMod * target)) + 
                    (CY_CAPSENSE_PERCENTAGE_100 >> 1u)) / CY_CAPSENSE_PERCENTAGE_100);
            }
            ptrSnsCxt++;
        }
        /* IDAC Normalization is performed separately for row and column  */
        if (((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdConfig->wdType) || 
            ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdConfig->wdType))
        {
            /* Find maximum and minimum IDACs */
            maxIdac = ptrWdCxt->rowIdacMod[freqChIndex];
            minIdac = ptrWdCxt->rowIdacMod[freqChIndex];
            ptrSnsCxt = &(ptrWdConfig->ptrSnsContext[(freqChIndex * context->ptrCommonConfig->numSns) + ptrWdConfig->numCols]);
            minRaw = ptrSnsCxt->raw;
            for(snsIndex = ptrWdConfig->numCols; snsIndex < ptrWdConfig->numSns; snsIndex++)
            {
                if (minIdac > ptrSnsCxt->idacComp)
                {
                    minIdac = ptrSnsCxt ->idacComp;
                    minRaw = ptrSnsCxt->raw;
                }
                ptrSnsCxt++;
            }
            
            /* Define new modulator IDAC */
            rawLevel = ((minRaw * CY_CAPSENSE_PERCENTAGE_100) / maxRawLevel) + CY_CAPSENSE_PERCENTAGE_100;
            iMod = (rawLevel * minIdac) / target;
            
            if (iMod > maxIdac)
            {
                iMod = maxIdac;
            }
            ptrWdCxt->rowIdacMod[freqChIndex] = (uint8_t)iMod;
            
            /* Re-calculate compensation IDAC */
            ptrSnsCxt = &(ptrWdConfig->ptrSnsContext[(freqChIndex * context->ptrCommonConfig->numSns) + ptrWdConfig->numCols]);
            for(snsIndex = 0u; snsIndex < ptrWdConfig->numCols; snsIndex++)
            {
                rawLevel = ((((uint32_t)ptrSnsCxt->raw * CY_CAPSENSE_PERCENTAGE_100) / maxRawLevel) + 
                    CY_CAPSENSE_PERCENTAGE_100) * ptrSnsCxt->idacComp;
                if (rawLevel < (iMod * target))
                {
                    ptrSnsCxt->idacComp = 0u;
                }
                else
                {
                    ptrSnsCxt->idacComp = (uint8_t)(((rawLevel - (iMod * target)) + 
                        (CY_CAPSENSE_PERCENTAGE_100 >> 1u)) / CY_CAPSENSE_PERCENTAGE_100);
                }
                ptrSnsCxt++;
            }
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_SsCSDCalibrate
****************************************************************************//**
*
* Implements IDAC calibration for a desired widget using successive 
* approximation algorithm.
*
* It supports any type of CSD widgets, and works 
* with multi-frequency scan and compensation IDAC features enabled.
*
* As result of function operation, the modulator IDAC that corresponds to the 
* sensor with the highest capacitance (the biggest modulator IDAC) is stored
* into widget data structure. If it is dual-axis widget type (touchpad or matrix 
* buttons) or if multi-frequency scan feature is enabled then the maximum 
* modulator IDAC found separately for each multi-frequency channel and for 
* rows/columns.
*
* If compensation IDAC is enabled, then it preserves IDAC value of 
* single-sensor calibration. In dual IDAC mode each sensor was calibrated with 
* equal values of modulator and compensation IDAC.
*
* After IDACs were found each sensor scanned again to get real raw count stored 
* in sensor structure.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found 
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param target
* Specifies the calibration target in percentages of the maximum raw count.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSDCalibrate(
                uint32_t widgetId, 
                uint32_t target, 
                cy_stc_capsense_context_t * context)
{
    uint32_t freqChIndex;
    uint32_t freqChNumber;
    uint32_t snsIndex;
    uint32_t rawTarget;
    uint32_t tmpVal;
    uint32_t cpuFreqMHz;
    uint32_t watchdogCounter;

    uint8_t calMask;
    uint8_t * ptrIdacMod;
    uint8_t * ptrIdacMax;
    uint8_t maxColIdac[CY_CAPSENSE_FREQ_CHANNELS_NUM] = {0u, 0u, 0u};
    uint8_t maxRowIdac[CY_CAPSENSE_FREQ_CHANNELS_NUM] = {0u, 0u, 0u};

    cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdCfg->ptrWdContext;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;

    /* Approximate duration of Wait For Init loop */
    const uint32_t isBusyLoopDuration = 5uL;

    /* Wait For Init watchdog timeout in microseconds */
    const uint32_t isBusyWatchdogTimeUs = 200000uL;

    rawTarget = ((uint32_t)ptrWdCxt->maxRawCount * target) / CY_CAPSENSE_PERCENTAGE_100;
    freqChNumber = (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->mfsEn) ? 3u : 1u;
        
    for(snsIndex = 0u; snsIndex < (uint32_t)ptrWdCfg->numSns; snsIndex++)
    {
        /* Set default IDAC code */
        calMask = (uint8_t)CY_CAPSENSE_CAL_MIDDLE_VALUE;
        ptrSnsCxt = &ptrWdCfg->ptrSnsContext[snsIndex];

        
        if (ptrWdCfg->numCols > snsIndex)
        {
            ptrIdacMod = ptrWdCxt->idacMod;
            ptrIdacMax = maxColIdac;
        }
        else
        {
            ptrIdacMod = ptrWdCxt->rowIdacMod;
            ptrIdacMax = maxRowIdac;
        }

