dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_csd.c
        for(freqChIndex = 0u; freqChIndex < freqChNumber; freqChIndex++)
        {
            ptrIdacMod[freqChIndex] = calMask;
            if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdIdacCompEn)
            {
                ptrSnsCxt[freqChIndex * context->ptrCommonConfig->numSns].idacComp = calMask;
            }
        }
        
        do
        {
            /* Need to configure the CSD HW block with each IDAC change */
            Cy_CapSense_CSDSetupWidgetExt(widgetId, snsIndex, context);
            /* Need to discharge Cmod capacitor */
            Cy_CapSense_CSDDischargeCmod(context);
            /* Scan the sensor */
            Cy_CapSense_CSDScanExt(context);

            cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / 1000000uL;
            watchdogCounter = Cy_CapSense_WatchdogCyclesNum(isBusyWatchdogTimeUs, cpuFreqMHz, isBusyLoopDuration);
            
            /* Wait for EOS */
            while (CY_CAPSENSE_SW_STS_BUSY  == (context->ptrCommonContext->status & CY_CAPSENSE_SW_STS_BUSY))
            {
                if(0uL == watchdogCounter)
                {
                    break;
                }
                watchdogCounter--;
            }

            /* Switch to the lower IDAC mask */
            calMask >>= 1u;
            for(freqChIndex = 0u; freqChIndex < freqChNumber; freqChIndex++)
            {
                /* Update IDAC based on scan result */
                if (ptrSnsCxt[freqChIndex * context->ptrCommonConfig->numSns].raw < rawTarget)
                {
                    ptrIdacMod[freqChIndex] &= (uint8_t)(~(uint8_t)(calMask << 1u));
                }

                ptrIdacMod[freqChIndex] |= (uint8_t)calMask;

                if(0u == ptrIdacMod[freqChIndex])
                {
                    ptrIdacMod[freqChIndex] = 1u;
                }
                if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdIdacCompEn)
                {
                    ptrSnsCxt[freqChIndex * context->ptrCommonConfig->numSns].idacComp = ptrIdacMod[freqChIndex];
                }
            }
            
        }
        while(calMask != 0u);

        for(freqChIndex = 0u; freqChIndex < freqChNumber; freqChIndex++)
        {
            /* Set the max Idac value */
            if (ptrIdacMax[freqChIndex] < ptrIdacMod[freqChIndex])
            {
                ptrIdacMax[freqChIndex] = ptrIdacMod[freqChIndex];
            }
        }
        
        /* Perform scan again to get real raw count if IDAC was changed last iteration */
        Cy_CapSense_CSDSetupWidgetExt(widgetId, snsIndex, context);
        Cy_CapSense_CSDScanExt(context);

        cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / 1000000uL;
        watchdogCounter = Cy_CapSense_WatchdogCyclesNum(isBusyWatchdogTimeUs, cpuFreqMHz, isBusyLoopDuration);

        /* Wait for EOS */
        while (CY_CAPSENSE_SW_STS_BUSY  == (context->ptrCommonContext->status & CY_CAPSENSE_SW_STS_BUSY))
        {
            if(0uL == watchdogCounter)
            {
                break;
            }
            watchdogCounter--;
        }
    }

    for(freqChIndex = 0u; freqChIndex < freqChNumber; freqChIndex++)
    {
        ptrWdCxt->idacMod[freqChIndex] = maxColIdac[freqChIndex];

        if (((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType) || 
            ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdCfg->wdType))
        {
            ptrWdCxt->rowIdacMod[freqChIndex] = maxRowIdac[freqChIndex];

            if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdIdacRowColAlignEn)
            {
                if (((uint32_t)ptrWdCxt->idacMod[freqChIndex] * ptrWdCxt->snsClk) <
                    ((uint32_t)ptrWdCxt->rowIdacMod[freqChIndex] * ptrWdCxt->rowSnsClk))
                {
                    tmpVal = ((uint32_t)ptrWdCxt->rowIdacMod[freqChIndex] * ptrWdCxt->rowSnsClk) / ptrWdCxt->snsClk;
                    if (tmpVal > CY_CAPSENSE_CAL_IDAC_MAX_VALUE)
                    {
                        tmpVal = CY_CAPSENSE_CAL_IDAC_MAX_VALUE;
                    }
                    ptrWdCxt->idacMod[freqChIndex] = (uint8_t)tmpVal;
                }
                else
                {
                    tmpVal = ((uint32_t)ptrWdCxt->idacMod[freqChIndex] * ptrWdCxt->snsClk) / ptrWdCxt->rowSnsClk;
                    if (tmpVal > CY_CAPSENSE_CAL_IDAC_MAX_VALUE)
                    {
                        tmpVal = CY_CAPSENSE_CAL_IDAC_MAX_VALUE;
                    }
                    ptrWdCxt->rowIdacMod[freqChIndex] = (uint8_t)tmpVal;
                }
            }
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDCalibrateWidget
****************************************************************************//**
*
* Executes the IDAC calibration for all the sensors in the widget specified in
* the input.
*
* \note This function is obsolete and kept for backward compatibility only. 
* The Cy_CapSense_CalibrateWidget() function should be used instead.
*
* Performs a successive approximation search algorithm to find appropriate
* modulator and compensation IDAC (if enabled) values for all sensors in 
* the specified widget that provides the raw count to the level 
* specified by the target parameter.
*
* Calibration returns CYRET_BAD_DATA if the achieved raw count is outside 
* of the range specified by the target and acceptable calibration deviation
* parameters.
*
* This function could be used when the CSD Enable IDAC auto-calibration
* parameter is enabled. It is recommended not to use this function when 
* the SmartSense auto-tuning mode is configured.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found 
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param target
* Specifies the calibration target in percentages of the maximum raw count.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified widget calibration:
* - CYRET_SUCCESS       - The operation is successfully completed.
* - CYRET_BAD_PARAM     - The input parameter is invalid.
* - CYRET_BAD_DATA      - The calibration failed and CapSense may not operate
*                         as expected.
* - CYRET_INVALID_STATE - The previous scanning is not completed, and 
*                         the CapSense middleware is busy.
*
*******************************************************************************/
cy_status Cy_CapSense_CSDCalibrateWidget(
                uint32_t widgetId, 
                uint32_t target, 
                cy_stc_capsense_context_t * context)
{
    cy_status calibrateStatus = CYRET_SUCCESS;
    uint32_t gainSwitch;

    uint32_t cpuFreqMHz;
    uint32_t watchdogCounter;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;

    /* Approximate duration of Wait For Init loop */
    const uint32_t isBusyLoopDuration = 5uL;

    /* Wait For Init watchdog timeout in microseconds */
    const uint32_t isBusyWatchdogTimeUs = 200000uL;

