dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_csd.c
    if (0u == watchdogCounter)
    {
        /* Set sequencer to idle state if coarse initialization fails */
        Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SEQ_START, CY_CAPSENSE_CSD_SEQ_START_ABORT_MSK);
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDTriggerScan
****************************************************************************//**
*
* Triggers the scanning.
*
* This function trigger the fine initialization (scan some dummy cycles) and 
* start sampling.
* For the fine initialization and sampling, Cmod is statically connected to 
* AMUXBUS-A and in every conversion (one cycle of SnsClk), the sensor 
* capacitance is charged from Cmod and discharged to ground using the 
* switches in GPIO cell. The CSDCOMP monitors voltage on Cmod using the 
* sense path and charges Cmod back to Vref using IDACs by connecting IDAC 
* to CSDBUS-A and then the AMUXBUS-A.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSDTriggerScan(cy_stc_capsense_context_t * context)
{
    /* Clear previous interrupts */
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_INTR, CY_CAPSENSE_CSD_INTR_ALL_MSK);
    (void)Cy_CSD_ReadReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_INTR);

    /* Enable SAMPLE interrupt */
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_INTR_MASK, CY_CAPSENSE_CSD_INTR_MASK_SAMPLE_MSK);


    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SW_HS_P_SEL, context->ptrInternalContext->csdRegSwHsPSelScan);

    /* Set scanning configuration for switches */
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SW_FW_MOD_SEL, CY_CAPSENSE_CSD_SW_FW_MOD_SEL_SCAN);
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SW_FW_TANK_SEL, context->ptrInternalContext->csdRegSwFwTankSelScan);
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SW_SHIELD_SEL, context->ptrInternalContext->csdRegSwShieldSelScan);

    if (0u != context->ptrCommonConfig->csdShieldEn)
    {
        if (0u != context->ptrCommonConfig->csdCTankShieldEn)
        {
            Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCsh, (uint32_t)context->ptrCommonConfig->pinCsh,
                                             CY_GPIO_DM_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXB);
        }
    }
    
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SW_RES, context->ptrInternalContext->csdRegSwResScan);
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_CSDCMP, CY_CAPSENSE_CSD_CSDCMP_CSDCMP_EN_MSK);
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_HSCMP, context->ptrInternalContext->csdRegHscmpScan);

    /* Force the LFSR to it's initial state (all ones) */
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SENSE_PERIOD, 
            Cy_CSD_ReadReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SENSE_PERIOD) | 
            CY_CAPSENSE_CSD_SENSE_PERIOD_LFSR_CLEAR_MSK | CY_CAPSENSE_CSD_SENSE_PERIOD_LFSR_BITS_MSK);

    /* Start SEQUENCER for fine initialization scan for Cmod and then for normal scan */
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SEQ_START, CY_CAPSENSE_CSD_SEQ_START_AZ0_SKIP_MSK | 
                                                                     CY_CAPSENSE_CSD_SEQ_START_AZ1_SKIP_MSK | 
                                                                     CY_CAPSENSE_CSD_SEQ_START_START_MSK);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDScanISR
****************************************************************************//**
*
* This is an internal ISR function to handle the CSD sensing method operation.
*
* This handler covers the following functionality:
* - Read the result of the measurement and store it into the corresponding 
*   register of the data structure.
* - If the Noise Metric functionality is enabled, then check the number of bad
*   conversions and repeat the scan of the current sensor of the number of bad
*   conversions is greater than the Noise Metric Threshold.
* - Initiate the scan of the next sensor for multiple sensor scanning mode.
* - Update the status register in the data structure.
* - Switch the CSD HW block to the default state if scanning of all the sensors is
*   completed.
*
* This is an internal ISR function for the single-sensor scanning implementation.
*
* \param capsenseContext
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDScanISR(void * capsenseContext)
{
    uint32_t rawData;
    uint32_t maxCount;
    cy_stc_capsense_context_t * cxt = (cy_stc_capsense_context_t *)capsenseContext;
    cy_stc_active_scan_sns_t * ptrActive = cxt->ptrActiveScanSns;
    
    /* Clear pending interrupt */
    Cy_CSD_WriteReg(cxt->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_INTR, CY_CAPSENSE_CSD_INTR_ALL_MSK);
    (void)Cy_CSD_ReadReg(cxt->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_INTR);

    /* Open HCBV and HCBG switches */
    Cy_CSD_WriteReg(cxt->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SW_SHIELD_SEL, 0u);

    /* Save raw count */
    maxCount = (1uL << ptrActive->ptrWdContext->resolution) - 1uL;
    rawData = Cy_CSD_ReadReg(cxt->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_RESULT_VAL1) & CY_CAPSENSE_CSD_RESULT_VAL1_VALUE_MSK;
    
    if(rawData > maxCount)
    {
        rawData = maxCount;
    }
    ptrActive->ptrSnsContext->raw = (uint16_t)rawData;

    /* Either complete scan or initiate new one */
    if((CY_CAPSENSE_ENABLE == cxt->ptrCommonConfig->mfsEn) &&
       (ptrActive->mfsChannelIndex < CY_CAPSENSE_MFS_CH2_INDEX))
    {
        Cy_CapSense_CSDInitNextChScan(cxt);
    }
    else if ((CY_CAPSENSE_SCAN_SCOPE_SGL_WD == ptrActive->scanScopeAll) &&
        (CY_CAPSENSE_SCAN_SCOPE_SGL_SNS == ptrActive->scanScopeSns))
    {
        Cy_CapSense_ClrBusyFlags(cxt);
    }
    else
    {
        /* Disable sensor */
        Cy_CapSense_CSDDisconnectSnsExt(cxt);
        /* Scan the next sensor */
        Cy_CapSense_CSDInitNextSnsScan(cxt);
    }
}


